Chat_v2_RubyOnRails/app/views/rooms/index.html.erb

              <span class='member-count'>
                <small><%= room.users.uniq.count %> Participantes</small>
---
SELECT "users".* FROM "users" INNER JOIN "messages" ON "users"."id" = "messages"."user_id" WHERE "messages"."room_id" = ?  [["room_id", 1]]

          <div id="messages">
            <% @room.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]