Chat_v2_RubyOnRails/app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.user = current_user
    @message.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Ancient-Jackhammer-715"], ["created_at", "2021-05-07 17:32:56.583883"], ["updated_at", "2021-05-07 17:32:56.583883"]]
INSERT INTO "messages" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asdas"], ["user_id", 1], ["room_id", 1], ["created_at", "2021-05-07 17:19:43.954606"], ["updated_at", "2021-05-07 17:19:43.954606"]]

    def set_message
      @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]